app/controllers/bills_controller.rb

SELECT "bills".* FROM "bills"  ORDER BY latest_major_action_date DESC
SELECT  "votes".* FROM "votes"  ORDER BY date DESC LIMIT 3
---
    def index

        #getting most recent bills and displaying...
        b = Bills.new
        bill_types = ['introduced', 'updated', 'active', 'passed', 'enacted', 'vetoed']
        bill_types.each do |bill_type|
            b.setUrl("https://api.propublica.org/congress/v1/115/senate/bills/" + bill_type + ".json")
            b.getRecentBills
        end

        #models to be accessed in the frontend
        @bills = Bill.all.order("latest_major_action_date DESC")
        # @votes = Vote.limit(3).order("date DESC").find_by(question: "On Passage")
        @votes = Vote.limit(3).order("date DESC")

SELECT  "bills".* FROM "bills" WHERE "bills"."bill_id" = $1 LIMIT 1  [["bill_id", "s534-115"]]
---
    def show
        @bill = Bill.find_by(bill_id: params[:id])