app/controllers/chambers_controller.rb

SELECT "govt_officials".* FROM "govt_officials"  ORDER BY votesWithParty DESC
---
    def senate
        #getting data from the api
        #should combine this into 1 but can fix this later...
        getMembersInfo("Senate")
        # getMembersInfo("House")
        @govtOfficials = GovtOfficial.all