app/controllers/govt_official_controller.rb

SELECT  "govt_officials".* FROM "govt_officials" WHERE "govt_officials"."member_id" = ? LIMIT 1  [["member_id", "H001061"]]
---
    def show
        @member = GovtOfficial.find(params[:id])